<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>ConsentText</key>
	<dict>
		<key>default</key>
		<string>
			指定時間後に自動で削除されます。すぐ削除してい場合は「一般」→「プロファイル」よりプロファイルを削除してください。
			接続番号は「$connection_number」です。キオスク端末の接続番号と一致するか確認してください。
		</string>
	</dict>
	<key>DurationUntilRemoval</key>
	<integer>$remaining_seconds</integer>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>Password</key>
			<string>$cert_pass</string>
			<key>PayloadCertificateFileName</key>
			<string>$cert_name</string>
			<key>PayloadContent</key>
			<data>
$cert_content
			</data>
			<key>PayloadDescription</key>
			<string>PKCS#12 フォーマットの証明書を追加します</string>
			<key>PayloadDisplayName</key>
			<string>$cert_name</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.security.pkcs12.8744EEC8-767C-41DA-86E1-428A6329BDDB</string>
			<key>PayloadType</key>
			<string>com.apple.security.pkcs12</string>
			<key>PayloadUUID</key>
			<string>8744EEC8-767C-41DA-86E1-428A6329BDDB</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>PayloadCertificateFileName</key>
			<string>ca.der</string>
			<key>PayloadContent</key>
			<data>
MIIEJzCCAw+gAwIBAgIJAML0H830Rr49MA0GCSqGSIb3DQEBBQUAMFgxCzAJBgNVBAYTAkpQMQ4w
DAYDVQQIEwVPc2FrYTEmMCQGA1UEChMdT3Nha2EgSW5zdGl0dXRlIG9mIFRlY2hub2xvZ3kxETAP
BgNVBAMTCFdBQUNTIENBMB4XDTE3MDEyMDAzNTYwOVoXDTE3MDMyMTAzNTYwOVowWDELMAkGA1UE
BhMCSlAxDjAMBgNVBAgTBU9zYWthMSYwJAYDVQQKEx1Pc2FrYSBJbnN0aXR1dGUgb2YgVGVjaG5v
bG9neTERMA8GA1UEAxMIV0FBQ1MgQ0EwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQC1
T1QzK53sawu1YVE8BUpwQtnEIaZfkehOksdetjJF1oCReSv7rfNbboHlNo5L9Zrh3tl8adA8ZFyw
GMEL/LSqsJuvTZFu4GTvto2Z4UmwXA105B5DkzW0phb5+RqL87bCDrpPaYxWt6g88VntaqDf0uiY
zbVj3lub2CravBQEKfFDOUJ6MF5RNJUfc4hjvF3D6Q4ibw9V+++8bHvI3DaEjHzrzdqAlD6qntxA
+9hOAWuiwpklh60Nvel2naVdiRyAXw0YR5IiYjm0mMNnuomm3MB6ALPrYNqyR0qbrLAGQb0yV24S
zJk2RcHrg5UCGgfqWJSBS0QH7MyJszTivVZvAgMBAAGjgfMwgfAwHQYDVR0OBBYEFDnYsFgmntuL
7a248cSc2VXkTuiHMIGJBgNVHSMEgYEwf4AUOdiwWCae24vtrbjxxJzZVeRO6IehXKRaMFgxCzAJ
BgNVBAYTAkpQMQ4wDAYDVQQIEwVPc2FrYTEmMCQGA1UEChMdT3Nha2EgSW5zdGl0dXRlIG9mIFRl
Y2hub2xvZ3kxETAPBgNVBAMTCFdBQUNTIENBggkAwvQfzfRGvj0wDAYDVR0TBAUwAwEB/zA1BgNV
HR8ELjAsMCqgKKAmhiRodHRwczovL3dhYWNzLnVuZGVyLW11LmNvbS93YWFjcy5jcmwwDQYJKoZI
hvcNAQEFBQADggEBACT35gV/8JFKtQ00JXuDaru83bHkZv/j3Tv6cxgqyPzwkkXHZEcwaBTbi2fU
zxNbdsCXqsDn3T0afPQKEgIZpF/gzXonrcnSLaPzUoU5oaTS04RO/3s4Sa1/M/Iy0WA0mMbVw3Vs
wCUwTz17JwRDijZ8SbfQomJe9aPoeagKUPyorrMcwpfp0t/mhloBe7DJOWMku/31niPQAM7RYYwi
U7zw1M5QfQotrfmoKftEnWhu097JbEqZQfhgSIy+GXs1WXZAw5RU/xPUZpoffs1X7SDbFYT1Idpx
85z0020jkPhKzwcWacvNOr8v4ONeniKI43Pb6YIqURmFCW3xrC/g0ZI=
			</data>
			<key>PayloadDescription</key>
			<string>CA ルート証明書を追加します</string>
			<key>PayloadDisplayName</key>
			<string>WAACS CA</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.security.root.8A8133ED-1691-422B-BDED-47CE98ADC116</string>
			<key>PayloadType</key>
			<string>com.apple.security.root</string>
			<key>PayloadUUID</key>
			<string>8A8133ED-1691-422B-BDED-47CE98ADC116</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
		<dict>
			<key>AutoJoin</key>
			<true/>
			<key>CaptiveBypass</key>
			<false/>
			<key>EAPClientConfiguration</key>
			<dict>
				<key>AcceptEAPTypes</key>
				<array>
					<integer>13</integer>
				</array>
				<key>PayloadCertificateAnchorUUID</key>
				<array>
					<string>F05C31DD-D7F5-4059-AEB1-3A6BF9E47924</string>
					<string>8A8133ED-1691-422B-BDED-47CE98ADC116</string>
				</array>
				<key>TLSTrustedServerNames</key>
				<array>
					<string>waacs.under-mu.com</string>
				</array>
			</dict>
			<key>EncryptionType</key>
			<string>WPA2</string>
			<key>HIDDEN_NETWORK</key>
			<false/>
			<key>IsHotspot</key>
			<false/>
			<key>PayloadCertificateUUID</key>
			<string>8744EEC8-767C-41DA-86E1-428A6329BDDB</string>
			<key>PayloadDescription</key>
			<string>Wi-Fi 設定を構成します</string>
			<key>PayloadDisplayName</key>
			<string>Wi-Fi</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.wifi.managed.AA0174F4-BEE6-43D0-892C-FA134188DE3D</string>
			<key>PayloadType</key>
			<string>com.apple.wifi.managed</string>
			<key>PayloadUUID</key>
			<string>AA0174F4-BEE6-43D0-892C-FA134188DE3D</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>ProxyType</key>
			<string>None</string>
			<key>SSID_STR</key>
			<string>$ssid</string>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>
WAACS Wi-Fi設定プロファイル($ssidを設定)
$ssidはEAP-TLSによる証明書での相互認証を行います。
接続番号は「$connection_number」です。キオスク端末の接続番号と一致するか確認
してください。
なお、$ssidはサーバ証明書を受け入れるため、ルート証明書も同時に追加されます。
        </string>
	<key>PayloadDisplayName</key>
	<string>WAACS EAP-TLS設定</string>
	<key>PayloadIdentifier</key>
	<string>9FF14944-4867-4712-8938-0C4998EF894A</string>
	<key>PayloadOrganization</key>
	<string>大阪工業大学</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>335CFBE2-382C-4DF5-9AB9-4146C0221FBD</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
